package ru.textanalysis.tawt.sp.rules.controlmodel.utils;

public class TestSentence {

    public static class NounsPersonRule {
        public static final String SENTENCE_1 =
                "Изысканный стиль одежды архитектора, неординарные идеи дизайнера интерьеров, глубокие знания психолога о человеческом поведении, сложные программы разработчика ПО и тщательно продуманные эксперименты ученого биолога внесли значительный вклад в успешное завершение международного исследовательского проекта.";

    }

    public static class VerbPrepositionRule {
        public static final String SENTENCE_1 =
                "Утром, перед выходом из дома, Андрей посмотрел в окно и увидел, что идет снег. По дороге на работу он зашел в кафе для быстрого завтрака. В офисе он сразу приступил к работе над проектом, но вскоре отвлекся на разговор с коллегой о последних новостях. После обеда он отправился в библиотеку за новыми книгами по маркетингу. Вечером, возвращаясь домой, он мечтал о предстоящем отпуске на море.";

    }

    public static class SensoryVerbsRule {
        public static final String SENTENCE_1 =
                "Видеть звёзды на ночном небе было необычайно приятно, ведь они могли слышать шум деревьев даже за кустами. Ощущать холод и чувствовать запах было для нас плохой затеей.";
    }
}
